{
  "architectures": [
    "VQModel"
  ],
  "commitment_cost": 0.25,
  "decay": 0.99,
  "hidden_dims": [
    64,
    128
  ],
  "in_channels": 8,
  "latent_dim": 128,
  "model_type": "vq_vae",
  "num_embeddings": 2048,
  "out_channels": 8,
  "torch_dtype": "float32",
  "transformers_version": "4.52.4"
}
